storage/tests/fd305ced-b96b-44fa-93a8-0267109d5afa/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/fd305ced-b96b-44fa-93a8-0267109d5afa/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (15.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (16.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (17.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (18.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (19.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (20.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (21.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (22.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (23.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (24.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (25.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (26.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (27.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (28.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (29.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (30.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s
time="2026-04-24T15:07:20+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:3009/auth/register\": request timeout"
time="2026-04-24T15:07:20+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:3009/auth/register\": request timeout"
time="2026-04-24T15:07:20+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:3009/auth/register\": request timeout"
[...]

running (31.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (32.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (33.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (34.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (35.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (36.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (37.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (38.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (39.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (40.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s
time="2026-04-24T15:07:30+05:30" level=warning msg="No script iterations fully finished, consider making the test duration longer"


  █ TOTAL RESULTS 

    checks_total.......: 10      0.249989/s
    checks_succeeded...: 0.00%   0 out of 10
    checks_failed......: 100.00% 10 out of 10

    ✗ status ok
      ↳  0% — ✓ 0 / ✗ 10

    CUSTOM
    api_data_received...: 0       0/s
    api_data_sent.......: 711     17.774218/s
    api_errors..........: 10      0.249989/s
    api_req_duration....: avg=30s min=30s med=30s max=30s p(90)=30s p(95)=30s
    api_reqs............: 10      0.249989/s

    HTTP
    http_req_duration...: avg=30s min=30s med=30s max=30s p(90)=30s p(95)=30s
    http_req_failed.....: 100.00% 10 out of 10
    http_reqs...........: 10      0.249989/s

    EXECUTION
    vus.................: 10      min=10       max=10
    vus_max.............: 10      min=10       max=10

    NETWORK
    data_received.......: 0 B     0 B/s
    data_sent...........: 4.1 kB  103 B/s



running (40.0s), 00/10 VUs, 0 complete and 10 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s